In [5]:
import pandas as pd
import numpy as np

In [164]:
Budgetdata_df=pd.read_csv("budget_data.csv")
Date_PL_df=Budgetdata_df[["Date","Profit/Losses"]]
Date_df=Date_PL_df["Date"]
PL_df=Date_PL_df["Profit/Losses"]

print("Financial Analysis")
print("-------------------")
print("Total Months:", Date_df.count())
print("Total:", PL_df.sum())
print("Average Change:", round(PL_df.mean(),2))
print("Greatest Increase in Profits:", Date_df.max(),PL_df.max())
print("Greatest Decrease in Profits:", Date_df.min(),PL_df.min())

Financial Analysis
-------------------
Total Months: 86
Total: 38382578
Average Change: 446309.05
Greatest Increase in Profits: Sep-2016 1170593
Greatest Decrease in Profits: Apr-2010 -1196225

446309.05

In [46]:
Budgetdata_df.describe(')

       Profit/Losses
count   8.600000e+01
mean    4.463090e+05
std     5.363579e+05
min    -1.196225e+06
25%     1.821620e+05
50%     5.703280e+05
75%     7.952262e+05
max     1.170593e+06

In [61]:
Budgetdata_df

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [103]:
PL_df.min()

-1196225

In [110]:
Budgetdata_df.head()

       Date  Profit/Losses
0  Jan-2010         867884
1  Feb-2010         984655
2  Mar-2010         322013
3  Apr-2010         -69417
4  May-2010         310503

        Date  Profit/Losses
0   Jan-2010         867884
1   Feb-2010         984655
2   Mar-2010         322013
3   Apr-2010         -69417
4   May-2010         310503
..       ...            ...
81  Oct-2016         102685
82  Nov-2016         795914
83  Dec-2016          60988
84  Jan-2017         138230
85  Feb-2017         671099

[86 rows x 2 columns]

In [154]:
print("Financial Analysis")
print("-------------------")
print("Total Months:", Date_df.count())
print("Total:", PL_df.sum())
print("Average Change:", PL_df.mean())
print("Greatest Increase in Profits:", Date_df.max(),PL_df.max())
print("Greatest Decrease in Profits:", Date_df.min(),PL_df.min())

Financial Analysis
-------------------
Total Months: 86
Total: 38382578
Average Change: 446309.0465116279
Greatest Increase in Profits: Sep-2016 1170593
Greatest Decrease in Profits: Apr-2010 -1196225

TypeError: You have to supply one of 'by' and 'level'

0     867884
1     984655
2     322013
3     -69417
4     310503
       ...
81    102685
82    795914
83     60988
84    138230
85    671099
Name: Profit/Losses, Length: 86, dtype: int64

In [153]:
print'''"Financial Analysis")
print("------(-------------")
print("Total Months:", Date_df.count())
print("Total:", PL_df.sum())
print("Average Change:", PL_df.mean())
print("Greatest Increase in Profits:", Date_df.max(),PL_df.max())
("Greatest Decrease in Profits:", Date_df.min(),PL_df.min() '''

SyntaxError: invalid syntax (<ipython-input-153-94f7719b42f6>, line 7)